# HostMismatch Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..HostObjFailures..::..HostMismatch Property
BuiltInFailures..::..HostObjFailures Class See Also
---
Can't use this type in this host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HostMismatch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HostMismatch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HostMismatch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..HostObjFailures Class
Autodesk.Revit.DB Namespace